<script setup lang="ts">
import { ref } from "vue";
import { useWebAppHapticFeedback } from "vue-tg";

defineProps<{ msg: string }>();

const count = ref(0);

const { notificationOccurred } = useWebAppHapticFeedback();

function increment() {
  notificationOccurred("success");
  count.value++;
}
</script>

<template>
  <h1>Welcome to Cube Worlds!</h1>

  <div class="card">
    Привет! У нас тут есть возможность получить игровой NFT, планируется жетон $CUBE...
    съешь ещё этих мягких французских булок, да выпей чаю. съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю съешь ещё этих мягких
    французских булок, да выпей чаю съешь ещё этих мягких французских булок, да выпей чаю
    съешь ещё этих мягких французских булок, да выпей чаю
    <!-- <button type="button" @click="increment">Count is {{ count }}</button>
    <p>
      Edit
      <code>components/HelloWorld.vue</code> to test HMR
    </p> -->
    <!-- <MainButton :progress="true" :text="`Count is ${count}`" @click="increment" />
    <SettingsButton @click="increment" /> -->

    <!-- <RouterLink to="/faq">Go to FAQ</RouterLink> -->
  </div>
</template>
